---
type: AreaVolumeSettings
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# AreaVolumeSettings

`Autodesk.Revit.DB.AreaVolumeSettings` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetAreaVolumeSettings | 2014 | `public static AreaVolumeSettings GetAreaVolumeSettings ( Document aDoc )` |
| Method | GetSpatialElementBoundaryLocation | 2014 | `public SpatialElementBoundaryLocation GetSpatialElementBoundaryLocation ( SpatialElementType spType )` |
| Method | SetSpatialElementBoundaryLocation | 2014 | `public void SetSpatialElementBoundaryLocation ( SpatialElementBoundaryLocation spatialElementBoundaryLocation , SpatialElementType spType )` |
| Property | ComputeVolumes | 2014 | `public bool ComputeVolumes { get ; set ; }` |
| Property | Parameter | — | `` |